<template>
  <div id="form-main">
    <img :src="transport">
    <mu-auto-complete hintText="请输入起点" labelFloat v-model="startPoint" label="起点" :dataSource="dataSource"
                      :maxHeight="120"/>
    <mu-auto-complete hintText="请输入终点" labelFloat v-model="endPoint" label="终点" :dataSource="dataSource"
                      :maxHeight="120"/>
    <mu-raised-button label="提交" @click="sureEvent" class="demo-raised-button" primary/>
    <infoDialog></infoDialog>
  </div>
</template>

<script>
  import transport from "../assets/images/public-transport.png"
  import infoDialog from "../components/InfoDialog.vue"
  export default {
    data () {
      return {
        transport,
        dataSource: ["通河新村", "彭浦新村", "九亭", "徐家汇", "莘庄", "上海火车站",
          "漕河泾开发区", "共康路", "共富新村", "陕西南路", "淞虹路", "延长路", "陆家嘴",
          "上海马戏城", "七宝", "中山公园", "莲花路", "南京西路", "徐泾东", "泗泾", "汶水路",
          "东川路", "佘山", "静安寺", "虹桥火车站", "南京东路", "娄山关路", "宝安公路",
          "世纪公园", "桂林路", "黄陂南路", "人民广场", "东昌路", "曹杨路", "呼兰路",
          "合川路", "金平路", "松江大学城", "龙阳路", "世纪大道", "富锦路", "豫园",
          "广兰路", "延安西路", "漕宝路", "浦电路", "江湾镇", "宜山路", "虹桥2号航站楼",
          "北新泾", "真北路", "虹口足球场", "颛桥", "金运路", "伊犁路", "浦东大道",
          "成山路", "大连路", "北桥", "沈杜公路", "张江高科", "威宁路", "天潼路", "华宁路",
          "锦江乐园", "中山北路", "金科路", "汉中路", "临平路", "杨树浦路", "江苏路",
          "镇坪路", "闵行开发区", "顾村公园", "嘉定北", "四川北路", "陆家浜路", "长寿路",
          "长江南路", "杨高中路", "交通大学", "上海南站", "大华三路", "龙柏新村", "上海大学站",
          "唐镇", "宝山路", "同济大学", "中潭路", "东宝兴路", "曲阳路", "大柏树", "上海体育馆",
          "南翔", "杨思", "外环路", "市光路", "打浦桥", "上海科技馆", "西藏北路", "宋园路",
          "殷高西路", "剑川路", "西藏南路", "水城路", "商城路", "金沙江路", "芳华路", "五角场",
          "延吉中路", "新村路", "松江体育中心", "虹桥路", "江湾体育场", "耀华路", "赤峰路", "新天地",
          "行知路", "老西门", "花木路", "虹桥1号航站楼", "江浦路", "黄兴路", "大渡河路", "川沙",
          "嫩江路", "龙溪路", "中兴路", "惠南", "大世界", "松江新城", "常熟路", "龙漕路", "浦东国际机场",
          "肇嘉浜路", "航中路", "祁连山路", "场中路", "昌平路", "新闸路", "蓝村路", "海伦路", "小南门",
          "滴水湖", "国权路", "美兰湖", "上海动物园", "中春路", "芦恒路", "衡山路", "洞泾",
          "友谊西路", "马当路", "江杨北路", "李子园路", "高青路", "锦绣路", "祁连山南路", "石龙路",
          "华夏东路", "上海体育场", "鲁班路", "岚皋路", "桃浦新村", "长清路", "嘉定新城", "塘桥",
          "安亭", "鞍山新村", "四平路", "枫桥路", "隆昌路", "博兴路", "翔殷路", "银都路", "淞浜路",
          "凌兆新村", "邮电新村", "上海赛车场", "嘉定西", "嘉善路", "星中路", "杨高南路", "漕溪路",
          "周浦东", "花桥", "丰庄", "春申路", "浦江镇", "醉白池", "上南路", "江月路", "金海路", "上海西站",
          "友谊路", "刘行", "文井路", "三林", "东明路", "南浦大桥", "金桥路", "华夏西路", "武宁路",
          "大木桥路 ", "上海图书馆", "云台路", "龙华中路", "东靖路", "水产路", "灵岩南路", "新江湾城",
          "巨峰路", "曲阜路", "五莲路", "马陆", "云山路", "白银路", "兆丰路", "联航路", "黄兴公园",
          "东安路", "德平路", "上海游泳馆", "杨高北路", "松江南站", "宁国路", "临沂新村", "隆德路",
          "三林东", "江浦公园", "临港大道", "上海儿童医学中心", "上大路", "宝杨路", "御桥", "淞发路",
          "高科西路", "书院", "东陆路", "金京路", "三门路", "铁力路", "上海汽车城", "源深体育中心",
          "航津路", "真如", "罗山路", "大场镇", "新场", "紫藤路", "南陈路", "爱国路", "罗南新村",
          "外高桥保税区北", "外高桥保税区南", "申江路", "海天三路", "民生路", "鹤沙航城",
          "国际客运中心", "浦三路", "金沙江西路", "光明路", "港城路", "远东大道", "中华艺术宫",
          "北洋泾路", "洲海路", "凌空路", "龙华", "提篮桥", "潘广路", "东方体育中心", "昌吉东路",
          "祁华路", "五洲大道", "张华浜", "上海野生动物园", "后滩", "航头东", "龙耀路", "殷高东路",
          "惠南东", "云锦路", "武威路", "华夏中路", "创新中路", "复兴岛"],
        startPoint: "",
        endPoint: "",
      }
    },

    components: {
      infoDialog
    },

    methods: {
      sureEvent() {
        if (this.startPoint != "" && this.endPoint != "") {
          this.$router.push(
            {
              name: 'package',
              params: {
                start: this.startPoint,
                end: this.endPoint
              }
            }
          );
        } else {
          this.$children[3].next = '/index';
          this.$children[3].msg = "请输入起点与终点!";
          this.$children[3].dialog = true;
        }
      }
    },

    created: function () {
      this.$parent.$children[2].bottomNav = "package";
      this.$parent.$children[2].bottomNavColor = "package";
      this.$parent.isShowStepper = true;
      this.$parent.$children[1].activeStep = 0;
    }
  }

</script>

<style>
  #form-main {
    display: flex;
    flex-direction: column;
    align-items: center;
    height: 100%;
    width: 100%;
    margin-top: 9%;
  }

</style>
